# Taps
tap "azure/kubelogin"
tap "carvel-dev/carvel"
tap "hashicorp/tap"

# CLI Tools - Core
brew "bat"
brew "diff-so-fancy"
brew "gh"
brew "imagemagick"
brew "jq"
brew "mas"
brew "neovim"
brew "tmux"
brew "yadm"
brew "yq"

# CLI Tools - Languages/Package Managers
brew "nvm"
brew "pipx"
brew "pnpm"
brew "pyenv"

# CLI Tools - Kubernetes/DevOps
brew "argocd"
brew "azure-cli"
brew "helm"
brew "tilt"
brew "azure/kubelogin/kubelogin"
brew "carvel-dev/carvel/vendir"
brew "hashicorp/tap/terraform"

# CLI Tools - Database
brew "libpq", link: true
brew "pgcli"
brew "postgresql@16", restart_service: :changed
brew "redis"

# CLI Tools - Networking
brew "ngrok"
brew "railway"

# Apps - Browsers
cask "arc"
cask "google-chrome"

# Apps - Dev Tools
cask "cursor"
cask "datagrip"
cask "docker-desktop"
cask "gcloud-cli"
cask "ghostty"
cask "lens"

# Apps - AI
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"

# Apps - Productivity
cask "1password"
cask "cleanshot"
cask "linear-linear"
cask "muzzle"
cask "notion"
cask "notion-calendar"
cask "quo"
cask "raycast"
cask "rectangle"
cask "superhuman"

# Apps - Communication
cask "slack"
cask "telegram"
cask "wechat"
cask "whatsapp"
cask "zoom"

# Apps - Media
cask "iina"
cask "spotify"

# Apps - Cloud/Storage
cask "adobe-creative-cloud"
cask "google-drive"

# Apps - Microsoft Office
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# Apps - VPN
cask "tunnelblick"

# Apps - Other
cask "windows-app"

# Mac App Store
mas "Slack", id: 803453959
mas "Things", id: 904280696

# VS Code / Cursor Extensions
vscode "aaron-bond.better-comments"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "tchoupinax.tilt"
vscode "vscodevim.vim"
